app/views/stores/index.html.erb

        <td><%= store.city %></td>
       <td><%= store.assignments.current.count %></td>
---
SELECT COUNT(*) FROM "assignments" WHERE "assignments"."store_id" = ? AND (end_date IS NULL)  [["store_id", 1]]