app/controllers/assignments_controller.rb

  def create
      @assignment = Assignment.new(assignment_params)
    if @assignment.save
---
INSERT INTO "assignments" ("store_id", "employee_id", "start_date") VALUES (?, ?, ?)

  def destroy
    @assignment.destroy
---
DELETE FROM "assignments" WHERE "assignments"."id" = ?

    def set_assignment
      @assignment = Assignment.find(params[:id])
---
SELECT  "assignments".* FROM "assignments" WHERE "assignments"."id" = ? LIMIT ?