app/controllers/assignments_controller.rb

  def index
      @current_assignments = Assignment.current.chronological.paginate(page: params[:page]).per_page(15)
---
SELECT  "assignments".* FROM "assignments" WHERE (end_date IS NOT NULL) ORDER BY start_date DESC, end_date DESC LIMIT ? OFFSET ?  [["LIMIT", 15], ["OFFSET", 0]]
SELECT COUNT(*) FROM "assignments"

  def create
      @assignment = Assignment.new(assignment_params)
    if @assignment.save
---
INSERT INTO "assignments" ("store_id", "employee_id", "start_date") VALUES (?, ?, ?)  [["store_id", 1], ["employee_id", 2], ["start_date", "2020-04-01"]]

  def destroy
    @assignment.destroy
---
DELETE FROM "assignments" WHERE "assignments"."id" = ?  [["id", 1]]

    def set_assignment
      @assignment = Assignment.find(params[:id])
---
SELECT  "assignments".* FROM "assignments" WHERE "assignments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]