app/controllers/employees_controller.rb

  def create
      @employee = Employee.new(employee_params)
    if @employee.save
      # if saved to database
      flash[:notice] = "Successfully added #{@employee.proper_name} as an employee."
      redirect_to employee_path(Employee.last)
---
INSERT INTO "employees" ("first_name", "last_name", "ssn", "date_of_birth", "phone", "role", "active") VALUES (?, ?, ?, ?, ?, ?, ?)
SELECT  "employees".* FROM "employees" ORDER BY "employees"."id" DESC LIMIT ?

  def update
    if @employee.update_attributes(employee_params)
---
UPDATE "employees" SET "first_name" = ?, "last_name" = ?, "ssn" = ?, "phone" = ?, "date_of_birth" = ? WHERE "employees"."id" = ?

    def set_employee
      @employee = Employee.find(params[:id])
---
SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?