app/controllers/employees_controller.rb

  def index
      @active_managers = Employee.managers.active.alphabetical.paginate(page: params[:page]).per_page(15)
---
SELECT  "employees".* FROM "employees" WHERE (role = 'manager') AND "employees"."active" = ? ORDER BY last_name, first_name LIMIT ? OFFSET ?  [["active", 1], ["LIMIT", 15], ["OFFSET", 0]]
SELECT COUNT(*) FROM "employees" WHERE "employees"."active" = ?  [["active", 1]]

  def create
      @employee = Employee.new(employee_params)
    if @employee.save
      # if saved to database
      flash[:notice] = "Successfully added #{@employee.proper_name} as an employee."
      redirect_to employee_path(Employee.last)
---
INSERT INTO "employees" ("first_name", "last_name", "ssn", "date_of_birth", "phone", "role", "active") VALUES (?, ?, ?, ?, ?, ?, ?)  [["first_name", "Ezra"], ["last_name", "Bridger"], ["ssn", "037201234"], ["date_of_birth", "2001-04-02"], ["phone", "4122683259"], ["role", "employee"], ["active", 1]]
SELECT  "employees".* FROM "employees" ORDER BY "employees"."id" DESC LIMIT ?  [["LIMIT", 1]]

  def update
    if @employee.update_attributes(employee_params)
---
UPDATE "employees" SET "first_name" = ?, "last_name" = ?, "ssn" = ?, "phone" = ?, "date_of_birth" = ? WHERE "employees"."id" = ?  [["first_name", "Mark"], ["last_name", "Heimann"], ["ssn", "037201234"], ["phone", "4122683259"], ["date_of_birth", "1994-04-02"], ["id", 1]]

    def set_employee
      @employee = Employee.find(params[:id])
---
SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]