app/controllers/stores_controller.rb

SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?
SELECT "assignments".* FROM "assignments" WHERE "assignments"."store_id" = ? AND (end_date IS NULL)
---
  def show

    @current_managers = @store.assignments.current.map{|a| a.employee}.select{|e| e.role == 'manager'}

INSERT INTO "stores" ("name", "street", "city", "state", "zip", "phone", "active") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
       @store = Store.new(store_params)
    if @store.save

UPDATE "stores" SET "name" = ?, "street" = ?, "city" = ?, "zip" = ?, "phone" = ? WHERE "stores"."id" = ?
---
  def update
      if @store.update_attributes(store_params)

SELECT  "stores".* FROM "stores" WHERE "stores"."id" = ? LIMIT ?
---
    def set_store
      @store = Store.find(params[:id])