app/controllers/stores_controller.rb

SELECT  "stores".* FROM "stores" WHERE "stores"."active" != ? LIMIT ? OFFSET ?  [["active", 1], ["LIMIT", 15], ["OFFSET", 0]]
SELECT COUNT(*) FROM "stores" WHERE "stores"."active" = ?  [["active", 1]]
---
  def index
		@active_stores = Store.active.paginate(page: params[:page]).per_page(15)

SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "assignments".* FROM "assignments" WHERE "assignments"."store_id" = ? AND (end_date IS NULL)  [["store_id", 1]]
---
  def show

    @current_managers = @store.assignments.current.map{|a| a.employee}.select{|e| e.role == 'manager'}

INSERT INTO "stores" ("name", "street", "city", "state", "zip", "phone", "active") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "CMU"], ["street", "5000 Forbes Avenue"], ["city", "Pittsburgh"], ["state", "PA"], ["zip", "15213"], ["phone", "9758632860"], ["active", 1]]
---
  def create
       @store = Store.new(store_params)
    if @store.save

UPDATE "stores" SET "name" = ?, "street" = ?, "city" = ?, "zip" = ?, "phone" = ? WHERE "stores"."id" = ?  [["name", "North Hills"], ["street", "Sudberry Dr"], ["city", "Wexford"], ["zip", "15090"], ["phone", "7242682323"], ["id", 1]]
---
  def update
      if @store.update_attributes(store_params)

SELECT  "stores".* FROM "stores" WHERE "stores"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_store
      @store = Store.find(params[:id])