app/models/assignment.rb

SELECT "employees".* FROM "employees" WHERE "employees"."active" = ?
---
  def employee_is_active_in_system
    all_employee_ids = Employee.active.map(&:id)

SELECT "stores".* FROM "stores" WHERE "stores"."active" = ?
---
  def store_is_active_in_system
    all_store_ids = Store.active.map(&:id)