app/models/employee.rb

  def current_assignment
    curr_assignment = self.assignments.current
    return nil if curr_assignment.empty?
---
SELECT  1 AS one FROM "assignments" WHERE "assignments"."employee_id" = ? AND (end_date IS NULL) LIMIT ?
SELECT  "assignments".* FROM "assignments" WHERE "assignments"."employee_id" = ? AND (end_date IS NULL) ORDER BY "assignments"."id" ASC LIMIT ?